# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

fusion_mode: CARM     
fallback_mode: bifpn  
node_mode: RepC3
head_channel: 256


backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, SPDConv_test, [64, 64]]

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]  # 4 
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5 
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7


head:
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 8
  - [-1, 1, BiLevelRoutingAttention, [256, 8]]     # 9
  - [-1, 1, Conv, [256, 1, 1]]                       # 10

  # 输入投影层
  - [4, 1, Conv, [head_channel, 1, 1]]             # 11
  - [5, 1, Conv, [head_channel, 1, 1]]             # 12
  - [6, 1, Conv, [head_channel, 1, 1]]             # 13
  - [10, 1, Conv, [head_channel, 1, 1]]            # 14

  # FPN
  - [14, 1, nn.Upsample, [None, 2, 'nearest']]     # 15
  - [[-1, 13], 1, Concat, [1]]                     # 16
  - [-1, 3, node_mode, [head_channel, 0.5]]        # 17

  - [17, 1, nn.Upsample, [None, 2, 'nearest']]     # 18
  - [[-1, 12], 1, Concat, [1]]                     # 19
  - [-1, 3, node_mode, [head_channel, 0.5]]        # 20

  
  - [20, 1, nn.Upsample, [None, 2, 'nearest']]     # 21
  - [[-1, 11], 1, Fusion, [fusion_mode]]           # 22
  - [-1, 3, node_mode, [head_channel, 0.5]]        # 23

  # PAN
  - [23, 1, Conv, [head_channel, 3, 2]]            # 24
  - [[-1, 12, 20], 1, Fusion, [fusion_mode]]       # 25
  - [-1, 3, node_mode, [head_channel, 0.5]]        # 26

  - [26, 1, Conv, [head_channel, 3, 2]]            # 27
  - [[-1, 13, 17], 1, Fusion, [fusion_mode]]       # 28
  - [-1, 3, node_mode, [head_channel, 0.5]]        # 29


  # 检测头
  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 30: Detect(X2, F3, F4)
